БухЭксп/Catalogs/CW_Рейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Рейсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Капитан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кругорейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Линия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Судно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоносамента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыКоносаментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетКругорейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Порт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Терминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Таможня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗахода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Рейсы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);    
	
	УстановитьОтборДинамическихСписков();
	УстановитьОтборГрузоперевозокКоносаментаНаСервере(Неопределено);

	Поле1ПриИзмененииНаСервере();

	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатаНачала 		= ТекущийОбъект.ДатаНачала;
	ДатаОкончания 	= ТекущийОбъект.ДатаОкончания;
	
	ПересчитатьПоказателиНаСервере();

КонецПроцедуры 

 &НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДатаНачала	= ДатаНачала;
	ТекущийОбъект.ДатаОкончания	= ДатаОкончания;

КонецПроцедуры
  
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПересчитатьПоказателиНаСервере();
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Рейсы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Наличие прикрепленных файлов
	Если ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
	//Наличие прикрепленных файлов
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	
	//Коносаменты
	Коносаменты.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Коносаменты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Рейс");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
	//--Коносаменты
	
	
	//Грузоперевозки
	Грузоперевозки.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Грузоперевозки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Рейс");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
    //--Грузоперевозки
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования) 

	ТекущаяСтрока = Элементы.Заходы.ТекущаяСтрока;
	ЗаходыПортПриИзмененииНаСервере(ТекущаяСтрока);

	ПодключитьОбработчикОжидания("ПересчитатьПоказателиРейса",0.1, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаходыПослеУдаления(Элемент)
	
	ПодключитьОбработчикОжидания("ПересчитатьПоказателиРейса",0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПоказателиРейса()
	
	ПересчитатьПоказателиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоказателиНаСервере()
	
	Если Объект.Заходы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительностьСтоянок_Минуты	= 0;
	ДлительностьРейса_Минуты	= 0;
	ДлительностьХода_Минуты		= 0;
	
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст  = "ВЫБРАТЬ
	|	Заходы.ДатаЗахода КАК ДатаЗахода,
	|	Заходы.ДатаВыхода КАК ДатаВыхода,
	|	РАЗНОСТЬДАТ(Заходы.ДатаЗахода, Заходы.ДатаВыхода, МИНУТА) КАК ДлительностьСтоянки
	|ПОМЕСТИТЬ ВТ_Заходы
	|ИЗ
	|	&Заходы КАК Заходы";
	
	Запрос.УстановитьПараметр("Заходы", Объект.Заходы.Выгрузить());  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос.Текст ="ВЫБРАТЬ
	|	МИНИМУМ(ВТ_Заходы.ДатаЗахода) КАК ДатаЗахода,
	|	МАКСИМУМ(ВТ_Заходы.ДатаВыхода) КАК ДатаВыхода,
	|	СУММА(ВТ_Заходы.ДлительностьСтоянки) КАК ДлительностьСтоянки
	|ПОМЕСТИТЬ ВТ_Рейс
	|ИЗ
	|	ВТ_Заходы КАК ВТ_Заходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Рейс.ДатаЗахода КАК ДатаЗахода,
	|	ВТ_Рейс.ДатаВыхода КАК ДатаВыхода,
	|	ВТ_Рейс.ДлительностьСтоянки КАК ДлительностьСтоянки,
	|	РАЗНОСТЬДАТ(ВТ_Рейс.ДатаЗахода, ВТ_Рейс.ДатаВыхода, МИНУТА) КАК ДлительностьРейсаСуммарно
	|ИЗ
	|	ВТ_Рейс КАК ВТ_Рейс";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаНачала 					= Выборка.ДатаЗахода;	
		ДатаОкончания 				= Выборка.ДатаВыхода;
		ДлительностьСтоянок_Минуты 	= Выборка.ДлительностьСтоянки;
		ДлительностьРейса_Минуты 	= Выборка.ДлительностьРейсаСуммарно;
		ДлительностьХода_Минуты 	= Макс(Выборка.ДлительностьРейсаСуммарно - Выборка.ДлительностьСтоянки, 0);
	КонецЕсли;
	
	ДлительностьРейса_Судосутки_Представление 	= Формат(ДлительностьРейса_Минуты/(60*24),"ЧДЦ=1; ЧГ=");
	ДлительностьРейса_Представление 			= ПредставлениеДлительностиНаСервере(ДлительностьРейса_Минуты);
	ДлительностьХода_Представление 				= ПредставлениеДлительностиНаСервере(ДлительностьХода_Минуты);
  	ДлительностьСтоянок_Представление 			= ПредставлениеДлительностиНаСервере(ДлительностьСтоянок_Минуты);

КонецПроцедуры
 
&НаСервере
Функция ПредставлениеДлительностиНаСервере(Длительность)
	
	Если Длительность = 0 Тогда
		Возврат "-"; 
	КонецЕсли;
	
	КоличествоЧасов = Цел(Длительность/60);
	КоличествоМинут = Длительность - КоличествоЧасов*60;   
	
	ШаблонВремя = "%1:%2";
	
	Возврат СтрШаблон(ШаблонВремя, 
				Формат(КоличествоЧасов,"ЧЦ=2; ЧДЦ=0; ЧН=00; ЧВН=; ЧГ="), 
				Формат(КоличествоМинут,"ЧЦ=2; ЧДЦ=0; ЧН=00; ЧВН=; ЧГ="));
	
КонецФункции

&НаКлиенте
Процедура КоносаментыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = ПолучитьЗначенияЗаполнения();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.CW_Коносаменты.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияЗаполнения()
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипКоносамента", 		Объект.ТипКоносамента);
	ЗначенияЗаполнения.Вставить("Линия", 				Объект.Линия);
	ЗначенияЗаполнения.Вставить("Рейс", 				Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Судно", 				Объект.Судно); 
	ЗначенияЗаполнения.Вставить("ТипПеревозки", 		Объект.ТипПеревозки); 
	ЗначенияЗаполнения.Вставить("Организация", 			Объект.Организация); 
	ЗначенияЗаполнения.Вставить("ДоставкаНаименование",	Объект.НаименованиеОрганизации); 
	ЗначенияЗаполнения.Вставить("ДоставкаАдрес", 		Объект.АдресОрганизации); 
	
	Если Объект.Заходы.Количество() > 0 Тогда
		ПерваяСтрока 	= Объект.Заходы[0];
		ПоследняяСтрока = Объект.Заходы[Объект.Заходы.Количество()-1];
		
		ЗначенияЗаполнения.Вставить("ПортОтправки",		ПерваяСтрока.Порт);
		ЗначенияЗаполнения.Вставить("ТерминалОтправки",	ПерваяСтрока.Терминал);
		ЗначенияЗаполнения.Вставить("ПортВыгрузки",		ПоследняяСтрока.Порт);
		ЗначенияЗаполнения.Вставить("ТерминалВыгрузки",	ПоследняяСтрока.Терминал); 
	КонецЕсли;

	Возврат ЗначенияЗаполнения;

КонецФункции

&НаСервере
Процедура ЗаходыПортПриИзмененииНаСервере(ТекущаяСтрока) 

	СтрокаТекущая = Объект.Заходы.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ЕстьДубли = ложь;
	Для каждого СтрокаЗахода из Объект.Заходы Цикл
		Если СтрокаЗахода = СтрокаТекущая Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаЗахода.Порт = СтрокаТекущая.Порт Тогда
			ЕстьДубли = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;  
	
	Если ЕстьДубли Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Порт уже указан в маршруте",,
		"Заходы["+Формат(Объект.Заходы.Индекс(СтрокаТекущая),"ЧГ=0")+"].Порт",
		"Объект", );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоносаментыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборГрузоперевозокКоносамента", 0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьОтборГрузоперевозокКоносамента()
	
	Коносамент = Элементы.Коносаменты.ТекущаяСтрока;
	УстановитьОтборГрузоперевозокКоносаментаНаСервере(Коносамент);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборГрузоперевозокКоносаментаНаСервере(Коносамент)
	
 	//ГрузоперевозкиКоносамента
	ГрузоперевозкиКоносамента.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = ГрузоперевозкиКоносамента.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Коносамент");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение 	= Коносамент;
    //--ГрузоперевозкиКоносамента

	
КонецПроцедуры 


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьДанныеОрганизацииНаСервере();
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДанныеОрганизацииНаСервере()
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(ТекущаяДата(), Объект.Организация);

	Объект.НаименованиеОрганизации 	= ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл;
	Объект.АдресОрганизации 		= ПараметрыУчетнойПолитики.АдресОрганизацииАнгл;
	
КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов

  &НаКлиенте
Процедура ПереводАдресОрганизации(Команда)
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "АдресОрганизации");
КонецПроцедуры

&НаКлиенте
Процедура ПереводКапитан(Команда)
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "Капитан");
КонецПроцедуры

&НаКлиенте
Процедура ПереводНаименованиеОрганизации(Команда)
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "НаименованиеОрганизации");
КонецПроцедуры

&НаСервере
Процедура Поле1ПриИзмененииНаСервере()
	Элементы.Кругорейс.Видимость = Объект.УчетКругорейса;
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	Поле1ПриИзмененииНаСервере();
КонецПроцедуры



#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры


#КонецОбласти
